Change Manual Graph
